SpenceKonde/megaTinyCore/boards.txt
##############################################################

atxy2.name=ATtiny412/402/212/202
atxy2.upload.workaround=
atxy2.build.millistimer=D0
atxy2.build.bootload=
atxy2.build.board=generic_txy2
atxy2.build.mcu=attiny{build.attiny}
atxy2.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy2.build.f_cpu={build.speed}000000L
atxy2.menu.serialevent.no=No (saves space)
atxy2.menu.serialevent.yes=Yes
atxy2.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy2.menu.serialevent.yes.build.serialevent=

atxy2.upload.tool=avrdude

atxy2.bootloader.flashcommand=
atxy2.bootloader.tool=avrdude

atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.board=ATtiny412
atxy2.menu.chip.412.build.attiny=412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.board=ATtiny212
atxy2.menu.chip.212.build.attiny=212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.board=ATtiny402
atxy2.menu.chip.402.build.attiny=402
atxy2.menu.chip.402.build.millistimer=A0
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.attiny=402
atxy2.menu.chip.402w.build.millistimer=A0
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.board=ATtiny202
atxy2.menu.chip.202.build.attiny=202
atxy2.menu.chip.202.build.millistimer=A0
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128

atxy2.menu.clock.20internal=20 MHz Internal
atxy2.menu.clock.16internal=16 MHz Internal
atxy2.menu.clock.10internal=10 MHz Internal
atxy2.menu.clock.8internal=8 MHz Internal
atxy2.menu.clock.5internal=5 MHz Internal
atxy2.menu.clock.4internal=4 MHz Internal
atxy2.menu.clock.1internal=1 MHz Internal
atxy2.menu.clock.20extclock=20 MHz External CLOCK
atxy2.menu.clock.16extclock=16 MHz External CLOCK
atxy2.menu.clock.12extclock=12 MHz External CLOCK
atxy2.menu.clock.10extclock=10 MHz External CLOCK
atxy2.menu.clock.8extclock=8 MHz External CLOCK
atxy2.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy2.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy2.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy2.menu.clock.20internal.build.speed=20
atxy2.menu.clock.20internal.build.clocksource=0
atxy2.menu.clock.16internal.build.speed=16
atxy2.menu.clock.16internal.build.clocksource=0
atxy2.menu.clock.10internal.build.speed=10
atxy2.menu.clock.10internal.build.clocksource=0
atxy2.menu.clock.8internal.build.speed=8
atxy2.menu.clock.8internal.build.clocksource=0
atxy2.menu.clock.5internal.build.speed=5
atxy2.menu.clock.5internal.build.clocksource=0
atxy2.menu.clock.4internal.build.speed=4
atxy2.menu.clock.4internal.build.clocksource=0
atxy2.menu.clock.1internal.build.speed=1
atxy2.menu.clock.1internal.build.clocksource=0
atxy2.menu.clock.20extclock.build.speed=20
atxy2.menu.clock.20extclock.build.clocksource=2
atxy2.menu.clock.16extclock.build.speed=16
atxy2.menu.clock.16extclock.build.clocksource=2
atxy2.menu.clock.12extclock.build.speed=12
atxy2.menu.clock.12extclock.build.clocksource=2
atxy2.menu.clock.10extclock.build.speed=10
atxy2.menu.clock.10extclock.build.clocksource=2
atxy2.menu.clock.8extclock.build.speed=8
atxy2.menu.clock.8extclock.build.clocksource=2
atxy2.menu.clock.24extclock.build.speed=24
atxy2.menu.clock.24extclock.build.clocksource=2
atxy2.menu.clock.28extclock.build.speed=28
atxy2.menu.clock.28extclock.build.clocksource=2
atxy2.menu.clock.32extclock.build.speed=32
atxy2.menu.clock.32extclock.build.clocksource=2
atxy2.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy2.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2.menu.bodvoltage.2v1=2.1V (unofficial)
atxy2.menu.bodvoltage.2v9=2.9V (unofficial)
atxy2.menu.bodvoltage.3v3=3.3V (unofficial)
atxy2.menu.bodvoltage.3v7=3.7V (unofficial)
atxy2.menu.bodvoltage.4v0=4.0V (unofficial)
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy2.menu.bodmode.disabled=Disabled/Disabled
atxy2.menu.bodmode.enabled=Enabled/Enabled
atxy2.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy2.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
atxy2.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy2.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy2.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy2.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy2.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2.menu.bodmode.disabled.bootloader.bodmodebits=00000
atxy2.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.eesavebit=1
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.eesavebit=0

atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.disabled.build.millistimer=NONE
atxy2.menu.millis.timera.build.millistimer=A0
atxy2.menu.millis.timerd.build.millistimer=D0
atxy2.menu.millis.timerb0.build.millistimer=B0
atxy2.menu.millis.rtc.build.millistimer=RTC

atxy2.menu.uartvoltage.5v=Closer to 5v
atxy2.menu.uartvoltage.3v=Closer to 3v
atxy2.menu.uartvoltage.5v.build.uartvoltage=5V
atxy2.menu.uartvoltage.3v.build.uartvoltage=3V


atxy2.build.core=megatinycore
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.extra_flags={build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}

#

