SpenceKonde/megaTinyCore/boards.txt
# Xplained boards with Tiny-1 chips

Xplained416.name=Attiny416 Xplained Nano (optiboot)
Xplained416.upload.workaround=
Xplained416.build.millistimer=D0
Xplained416.build.bootload=opti
Xplained416.build.mcu=attiny{build.attiny}
Xplained416.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained416.build.f_cpu={build.speed}000000L

Xplained416.build.attiny=416
Xplained416.build.board=attinyxy6
Xplained416.build.core=megatinycore
Xplained416.build.variant=txy6
Xplained416.build.speed=20
Xplained416.build.clocksource=0
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags={build.serialevent} {build.millis} -DUARTBAUD5V
Xplained416.menu.serialevent.no=No (saves space)
Xplained416.menu.serialevent.yes=Yes
Xplained416.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
Xplained416.menu.serialevent.yes.build.serialevent=

Xplained416.upload.tool=avrdude

Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x07
Xplained416.bootloader.APPEND=0x00

Xplained416.menu.millis.enabled=Enabled (default timer)
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.timera=TCA0
Xplained416.menu.millis.timerd=TCD0 (default)
Xplained416.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained416.menu.millis.enabled.build.millistimer=D0
Xplained416.menu.millis.rtc=RTC (no micros)
Xplained416.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (no micros)
Xplained416.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (no micros)
Xplained416.menu.millis.disabled.build.millistimer=NONE
Xplained416.menu.millis.timera.build.millistimer=A0
Xplained416.menu.millis.timerd.build.millistimer=D0
Xplained416.menu.millis.timerb0.build.millistimer=B0
Xplained416.menu.millis.rtc.build.millistimer=RTC
Xplained416.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
Xplained416.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.upload.workaround=
Xplained817.build.millistimer=D0
Xplained817.build.bootload=opti
Xplained817.build.mcu=attiny{build.attiny}
Xplained817.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained817.build.f_cpu={build.speed}000000L

Xplained817.build.attiny=817
Xplained817.build.board=attinyxy7
Xplained817.build.core=megatinycore
Xplained817.build.variant=txy7
Xplained817.build.speed=20
Xplained817.build.clocksource=0
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags={build.serialevent} {build.millis} -DUARTBAUD5V

Xplained817.menu.serialevent.no=No (saves space)
Xplained817.menu.serialevent.yes=Yes
Xplained817.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
Xplained817.menu.serialevent.yes.build.serialevent=

Xplained817.upload.tool=avrdude

Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x07
Xplained817.bootloader.APPEND=0x00

Xplained817.menu.millis.enabled=Enabled (default timer)
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.timera=TCA0
Xplained817.menu.millis.timerd=TCD0 (default)
Xplained817.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained817.menu.millis.rtc=RTC (no micros)
Xplained817.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (no micros)
Xplained817.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (no micros)
Xplained817.menu.millis.enabled.build.millistimer=D0
Xplained817.menu.millis.disabled.build.millistimer=NONE
Xplained817.menu.millis.timera.build.millistimer=A0
Xplained817.menu.millis.timerd.build.millistimer=D0
Xplained817.menu.millis.timerb0.build.millistimer=B0
Xplained817.menu.millis.rtc.build.millistimer=RTC
Xplained817.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
Xplained817.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.workaround=
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20internal=20 MHz Internal
atxy7o.menu.clock.16internal=16 MHz Internal
atxy7o.menu.clock.10internal=10 MHz Internal
atxy7o.menu.clock.8internal=8 MHz Internal
atxy7o.menu.clock.5internal=5 MHz Internal
atxy7o.menu.clock.4internal=4 MHz Internal
atxy7o.menu.clock.1internal=1 MHz Internal
atxy7o.menu.clock.20extclock=20 MHz External CLOCK
atxy7o.menu.clock.16extclock=16 MHz External CLOCK
atxy7o.menu.clock.12extclock=12 MHz External CLOCK
atxy7o.menu.clock.10extclock=10 MHz External CLOCK
atxy7o.menu.clock.8extclock=8 MHz External CLOCK
atxy7o.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy7o.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy7o.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy7o.menu.clock.20internal.build.speed=20
atxy7o.menu.clock.20internal.build.clocksource=0
atxy7o.menu.clock.16internal.build.speed=16
atxy7o.menu.clock.16internal.build.clocksource=0
atxy7o.menu.clock.10internal.build.speed=10
atxy7o.menu.clock.10internal.build.clocksource=0
atxy7o.menu.clock.8internal.build.speed=8
atxy7o.menu.clock.8internal.build.clocksource=0
atxy7o.menu.clock.5internal.build.speed=5
atxy7o.menu.clock.5internal.build.clocksource=0
atxy7o.menu.clock.4internal.build.speed=4
atxy7o.menu.clock.4internal.build.clocksource=0
atxy7o.menu.clock.1internal.build.speed=1
atxy7o.menu.clock.1internal.build.clocksource=0
atxy7o.menu.clock.20extclock.build.speed=20
atxy7o.menu.clock.20extclock.build.clocksource=2
atxy7o.menu.clock.16extclock.build.speed=16
atxy7o.menu.clock.16extclock.build.clocksource=2
atxy7o.menu.clock.12extclock.build.speed=12
atxy7o.menu.clock.12extclock.build.clocksource=2
atxy7o.menu.clock.10extclock.build.speed=10
atxy7o.menu.clock.10extclock.build.clocksource=2
atxy7o.menu.clock.8extclock.build.speed=8
atxy7o.menu.clock.8extclock.build.clocksource=2
atxy7o.menu.clock.24extclock.build.speed=24
atxy7o.menu.clock.24extclock.build.clocksource=2
atxy7o.menu.clock.28extclock.build.speed=28
atxy7o.menu.clock.28extclock.build.clocksource=2
atxy7o.menu.clock.32extclock.build.speed=32
atxy7o.menu.clock.32extclock.build.clocksource=2
atxy7o.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7o.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7o.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy7o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy7o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy7o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy7o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

