SpenceKonde/megaTinyCore/boards.txt
atxy7o.menu.bodmode.disabled=Disabled/Disabled
atxy7o.menu.bodmode.enabled=Enabled/Enabled
atxy7o.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy7o.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
atxy7o.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy7o.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy7o.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy7o.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy7o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7o.menu.bodmode.disabled.bootloader.bodmodebits=00000
atxy7o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy7o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy7o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy7o.menu.millis.enabled=Enabled (default timer)
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.timera=TCA0 (default on 0-series)
atxy7o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7o.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7o.menu.millis.rtc=RTC (no micros)
atxy7o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy7o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy7o.menu.millis.disabled.build.millistimer=NONE
atxy7o.menu.millis.timera.build.millistimer=A0
atxy7o.menu.millis.timerd.build.millistimer=D0
atxy7o.menu.millis.timerb0.build.millistimer=B0
atxy7o.menu.millis.timerb1.build.millistimer=B1
atxy7o.menu.millis.rtc.build.millistimer=RTC
atxy7o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy7o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy7o.menu.resetpinopti.UPDI=UPDI (powercycle to enter bootloader)
atxy7o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}.hex
atxy7o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy7o.menu.resetpinopti.reset=Reset (DANGER - Read docs first!)
atxy7o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}_rst.hex
atxy7o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy7o.menu.resetpinopti.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy7o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy7o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy7o.menu.startuptime.8= 8ms - A good default, usually fine
atxy7o.menu.startuptime.1= 1ms - (aggressive/very fast rising power)
atxy7o.menu.startuptime.64= 64ms - (cautious/slow rising power)
atxy7o.menu.startuptime.8.bootloader.SYSCFG1=0x03
atxy7o.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy7o.menu.startuptime.64.bootloader.SYSCFG1=0x07

atxy7o.menu.uartvoltage.5v=Closer to 5v
atxy7o.menu.uartvoltage.3v=Closer to 3v
atxy7o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy7o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy7o.menu.bootloaderuart.default=TX:9, RX:8
atxy7o.menu.bootloaderuart.alternate=TX:18, RX:19
atxy7o.menu.bootloaderuart.default.bootloader.uartswap=
atxy7o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy7o.menu.serialevent.no=No (saves space)
atxy7o.menu.serialevent.yes=Yes
atxy7o.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy7o.menu.serialevent.yes.build.serialevent=

atxy7o.upload.tool=avrdude

atxy7o.build.board=attinyxy7
atxy7o.build.core=megatinycore
atxy7o.build.variant=txy7
atxy7o.build.extra_flags={build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy7o.build.export_merged_output=true

atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02

atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D
atxy7o.build.text_section_start=.text=0x200
atxy7o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy7o.bootloader.tool=avrdude

##############################################################

atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (optiboot)
atxy6o.upload.workaround=
atxy6o.build.millistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.upload.speed=115200

atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.board=ATtiny3216
atxy6o.menu.chip.3216.build.attiny=3216
atxy6o.menu.chip.3216.upload.maximum_size=32256
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.board=ATtiny1616
atxy6o.menu.chip.1616.build.attiny=1616
atxy6o.menu.chip.1616.upload.maximum_size=15872
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.board=ATtiny816
atxy6o.menu.chip.816.build.attiny=816
atxy6o.menu.chip.816.upload.maximum_size=7680
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.board=ATtiny416
atxy6o.menu.chip.416.build.attiny=416
atxy6o.menu.chip.416.upload.maximum_size=3584
atxy6o.menu.chip.416.upload.maximum_data_size=256

atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.board=ATtiny1606
atxy6o.menu.chip.1606.build.attiny=1606
atxy6o.menu.chip.1606.build.millistimer=A0
atxy6o.menu.chip.1606.upload.maximum_size=15872
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.board=ATtiny806
atxy6o.menu.chip.806.build.attiny=806
atxy6o.menu.chip.806.build.millistimer=A0
atxy6o.menu.chip.806.upload.maximum_size=7680
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.board=ATtiny406
atxy6o.menu.chip.406.build.attiny=406
atxy6o.menu.chip.406.build.millistimer=A0
atxy6o.menu.chip.406.upload.maximum_size=3584
atxy6o.menu.chip.406.upload.maximum_data_size=256

atxy6o.menu.clock.20internal=20 MHz Internal
atxy6o.menu.clock.16internal=16 MHz Internal
atxy6o.menu.clock.10internal=10 MHz Internal
atxy6o.menu.clock.8internal=8 MHz Internal
atxy6o.menu.clock.5internal=5 MHz Internal
atxy6o.menu.clock.4internal=4 MHz Internal
atxy6o.menu.clock.1internal=1 MHz Internal
atxy6o.menu.clock.20extclock=20 MHz External CLOCK
atxy6o.menu.clock.16extclock=16 MHz External CLOCK
atxy6o.menu.clock.12extclock=12 MHz External CLOCK
atxy6o.menu.clock.10extclock=10 MHz External CLOCK
atxy6o.menu.clock.8extclock=8 MHz External CLOCK
atxy6o.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy6o.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy6o.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy6o.menu.clock.20internal.build.speed=20
atxy6o.menu.clock.20internal.build.clocksource=0
atxy6o.menu.clock.16internal.build.speed=16
atxy6o.menu.clock.16internal.build.clocksource=0
atxy6o.menu.clock.10internal.build.speed=10
atxy6o.menu.clock.10internal.build.clocksource=0
atxy6o.menu.clock.8internal.build.speed=8
atxy6o.menu.clock.8internal.build.clocksource=0
atxy6o.menu.clock.5internal.build.speed=5
atxy6o.menu.clock.5internal.build.clocksource=0
atxy6o.menu.clock.4internal.build.speed=4
atxy6o.menu.clock.4internal.build.clocksource=0
atxy6o.menu.clock.1internal.build.speed=1
atxy6o.menu.clock.1internal.build.clocksource=0
atxy6o.menu.clock.20extclock.build.speed=20
atxy6o.menu.clock.20extclock.build.clocksource=2
atxy6o.menu.clock.16extclock.build.speed=16
atxy6o.menu.clock.16extclock.build.clocksource=2
atxy6o.menu.clock.12extclock.build.speed=12
atxy6o.menu.clock.12extclock.build.clocksource=2
atxy6o.menu.clock.10extclock.build.speed=10
atxy6o.menu.clock.10extclock.build.clocksource=2
atxy6o.menu.clock.8extclock.build.speed=8
atxy6o.menu.clock.8extclock.build.clocksource=2
atxy6o.menu.clock.24extclock.build.speed=24
atxy6o.menu.clock.24extclock.build.clocksource=2
atxy6o.menu.clock.28extclock.build.speed=28
atxy6o.menu.clock.28extclock.build.clocksource=2
atxy6o.menu.clock.32extclock.build.speed=32
atxy6o.menu.clock.32extclock.build.clocksource=2
atxy6o.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy6o.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy6o.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy6o.menu.millis.enabled=Enabled (default timer)
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.timera=TCA0 (default on 0-series)
atxy6o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy6o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6o.menu.millis.timerb1=TCB1 (3216,1616 only)
atxy6o.menu.millis.rtc=RTC (no micros)
atxy6o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy6o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy6o.menu.millis.disabled.build.millistimer=NONE
atxy6o.menu.millis.timera.build.millistimer=A0
atxy6o.menu.millis.timerd.build.millistimer=D0
atxy6o.menu.millis.timerb0.build.millistimer=B0
atxy6o.menu.millis.timerb1.build.millistimer=B1
atxy6o.menu.millis.rtc.build.millistimer=RTC
atxy6o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy6o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

