SpenceKonde/megaTinyCore/boards.txt
atxy6o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy6o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy6o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy6o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy6o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy6o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy6o.menu.bodmode.disabled=Disabled/Disabled
atxy6o.menu.bodmode.enabled=Enabled/Enabled
atxy6o.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy6o.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
atxy6o.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy6o.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy6o.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy6o.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy6o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy6o.menu.bodmode.disabled.bootloader.bodmodebits=00000
atxy6o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy6o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy6o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy6o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy6o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy6o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy6o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy6o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy6o.menu.uartvoltage.5v=Closer to 5v
atxy6o.menu.uartvoltage.3v=Closer to 3v
atxy6o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy6o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy6o.build.board=attinyxy6
atxy6o.build.core=megatinycore
atxy6o.build.variant=txy6
atxy6o.build.extra_flags={build.serialevent} {build.millis} -DUARTBAUD{build.uartvoltage}
atxy6o.build.export_merged_output=true

atxy6o.menu.resetpinopti.UPDI=UPDI (powercycle to enter bootloader)
atxy6o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txy6{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy6o.menu.resetpinopti.reset=Reset (DANGER - Read docs first!)
atxy6o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txy6{bootloader.uartswap}_rst.hex
atxy6o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy6o.menu.resetpinopti.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy6o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy6o.menu.startuptime.8= 8ms - A good default, usually fine
atxy6o.menu.startuptime.1= 1ms - (aggressive/very fast rising power)
atxy6o.menu.startuptime.64= 64ms - (cautious/slow rising power)
atxy6o.menu.startuptime.8.bootloader.SYSCFG1=0x03
atxy6o.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy6o.menu.startuptime.64.bootloader.SYSCFG1=0x07

atxy6o.menu.serialevent.no=No (saves space)
atxy6o.menu.serialevent.yes=Yes
atxy6o.menu.serialevent.no.build.serialevent=-DNOSERIALEVENT
atxy6o.menu.serialevent.yes.build.serialevent=

atxy6o.upload.tool=avrdude

atxy6o.menu.bootloaderuart.default=TX:7, RX:6
atxy6o.menu.bootloaderuart.alternate=TX:14, RX:15
atxy6o.menu.bootloaderuart.default.bootloader.uartswap=
atxy6o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.TCD0CFG=0x00
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x02

atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D
atxy6o.build.text_section_start=.text=0x200
atxy6o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy6o.bootloader.BOOTEND=0x2
atxy6o.bootloader.tool=avrdude

##############################################################

atxy4o.name=ATtiny1614/1604/814/804/414/404/214/204 (optiboot)
atxy4o.upload.workaround=
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.upload.speed=115200

atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.board=ATtiny1614
atxy4o.menu.chip.1614.build.attiny=1614
atxy4o.menu.chip.1614.upload.maximum_size=15872
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.board=ATtiny814
atxy4o.menu.chip.814.build.attiny=814
atxy4o.menu.chip.814.upload.maximum_size=7680
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.board=ATtiny414
atxy4o.menu.chip.414.build.attiny=414
atxy4o.menu.chip.414.upload.maximum_size=3584
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.board=ATtiny214
atxy4o.menu.chip.214.build.attiny=214
atxy4o.menu.chip.214.upload.maximum_size=1536
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.board=ATtiny1604
atxy4o.menu.chip.1604.build.attiny=1604
atxy4o.menu.chip.1604.build.millistimer=A0
atxy4o.menu.chip.1604.upload.maximum_size=15872
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.board=ATtiny804
atxy4o.menu.chip.804.build.attiny=804
atxy4o.menu.chip.804.build.millistimer=A0
atxy4o.menu.chip.804.upload.maximum_size=7680
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.board=ATtiny404
atxy4o.menu.chip.404.build.attiny=404
atxy4o.menu.chip.404.build.millistimer=A0
atxy4o.menu.chip.404.upload.maximum_size=3584
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.board=ATtiny204
atxy4o.menu.chip.204.build.attiny=204
atxy4o.menu.chip.204.build.millistimer=A0
atxy4o.menu.chip.204.upload.maximum_size=1536
atxy4o.menu.chip.204.upload.maximum_data_size=128

atxy4o.menu.clock.20internal=20 MHz Internal
atxy4o.menu.clock.16internal=16 MHz Internal
atxy4o.menu.clock.10internal=10 MHz Internal
atxy4o.menu.clock.8internal=8 MHz Internal
atxy4o.menu.clock.5internal=5 MHz Internal
atxy4o.menu.clock.4internal=4 MHz Internal
atxy4o.menu.clock.1internal=1 MHz Internal
atxy4o.menu.clock.20extclock=20 MHz External CLOCK
atxy4o.menu.clock.16extclock=16 MHz External CLOCK
atxy4o.menu.clock.12extclock=12 MHz External CLOCK
atxy4o.menu.clock.10extclock=10 MHz External CLOCK
atxy4o.menu.clock.8extclock=8 MHz External CLOCK
atxy4o.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy4o.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy4o.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy4o.menu.clock.20internal.build.speed=20
atxy4o.menu.clock.20internal.build.clocksource=0
atxy4o.menu.clock.16internal.build.speed=16
atxy4o.menu.clock.16internal.build.clocksource=0
atxy4o.menu.clock.10internal.build.speed=10
atxy4o.menu.clock.10internal.build.clocksource=0
atxy4o.menu.clock.8internal.build.speed=8
atxy4o.menu.clock.8internal.build.clocksource=0
atxy4o.menu.clock.5internal.build.speed=5
atxy4o.menu.clock.5internal.build.clocksource=0
atxy4o.menu.clock.4internal.build.speed=4
atxy4o.menu.clock.4internal.build.clocksource=0
atxy4o.menu.clock.1internal.build.speed=1
atxy4o.menu.clock.1internal.build.clocksource=0
atxy4o.menu.clock.20extclock.build.speed=20
atxy4o.menu.clock.20extclock.build.clocksource=2
atxy4o.menu.clock.16extclock.build.speed=16
atxy4o.menu.clock.16extclock.build.clocksource=2
atxy4o.menu.clock.12extclock.build.speed=12
atxy4o.menu.clock.12extclock.build.clocksource=2
atxy4o.menu.clock.10extclock.build.speed=10
atxy4o.menu.clock.10extclock.build.clocksource=2
atxy4o.menu.clock.8extclock.build.speed=8
atxy4o.menu.clock.8extclock.build.clocksource=2
atxy4o.menu.clock.24extclock.build.speed=24
atxy4o.menu.clock.24extclock.build.clocksource=2
atxy4o.menu.clock.28extclock.build.speed=28
atxy4o.menu.clock.28extclock.build.clocksource=2
atxy4o.menu.clock.32extclock.build.speed=32
atxy4o.menu.clock.32extclock.build.clocksource=2
atxy4o.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy4o.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy4o.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy4o.menu.millis.enabled=Enabled (default timer)
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.timera=TCA0 (default on 0-series)
atxy4o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4o.menu.millis.timerb1=TCB1 (1614 only)
atxy4o.menu.millis.rtc=RTC (no micros)
atxy4o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy4o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy4o.menu.millis.disabled.build.millistimer=NONE
atxy4o.menu.millis.timera.build.millistimer=A0
atxy4o.menu.millis.timerd.build.millistimer=D0
atxy4o.menu.millis.timerb0.build.millistimer=B0
atxy4o.menu.millis.timerb1.build.millistimer=B1
atxy4o.menu.millis.rtc.build.millistimer=RTC
atxy4o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy4o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy4o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy4o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy4o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy4o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy4o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy4o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy4o.menu.bodmode.disabled=Disabled/Disabled
atxy4o.menu.bodmode.enabled=Enabled/Enabled
atxy4o.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy4o.menu.bodmode.ensampslo=Enabled/Sampled (125Hz)
atxy4o.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy4o.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy4o.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy4o.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy4o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4o.menu.bodmode.disabled.bootloader.bodmodebits=00000
atxy4o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy4o.menu.uartvoltage.5v=Closer to 5v
atxy4o.menu.uartvoltage.3v=Closer to 3v
atxy4o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy4o.menu.uartvoltage.3v.build.uartvoltage=3V

